# {index}`System Configuration Commands`
## {index}`hostname`

### Назначение команды
Для указания или изменения имени хоста на коммутаторе используйте команду `hostname` в глобальной конфигурации. Для восстановления значения по умолчанию используйте команду `no hostname`.

### Синтаксис команды
```
hostname NAME
no hostname
```

| Параметр | Описание параметра      | Значение параметра          |
|----------|-------------------------|-----------------------------|
| NAME     | Имя хоста для коммутатора | Строка (1-63 символа)       |

### Командный режим
global config

### По умолчанию
Имя хоста по умолчанию `Switch`.

### Употребление
Имя хоста используется в приглашениях и в именах файлов конфигурации. Имя должно соответствовать правилам ARPANET и содержать только буквы, цифры, дефисы и подчеркивание. Имена должны состоять из 64 символов или меньше.

### Примеры
```console
Switch# configure terminal
Switch(config)# hostname aquaswitch
aquaswitch(config)#
```
## {index}`management ip address`

### Назначение команды
Используйте эту команду для назначения IP-адреса на интерфейсе управления коммутатора. Для удаления IP-адреса используйте форму `no` этой команды.

### Синтаксис команды
```
management ip address ( X.X.X.X/M | X.X.X.X MASK ) ( gateway Y.Y.Y.Y/M | )
no management ip address
management ipv6 address ( X:X::X:X/M | X:X::X:X MASK ) ( gateway Y:Y::Y:Y | )
no management ipv6 address
```

| Параметр        | Описание | Возможные значения |
|-----------------|---------------------------------------------|---------------------------------|
| X.X.X.X/M       | {term}`IPv4`-адрес управления с длиной маски   | IPv4-адрес с длиной маски 1-32  |
| X.X.X.X MASK       | IPv4-адрес управления и маска   | IPv4-адрес и маска  |
| X:X::X:X/M      | {term}`IPv6`-адрес управления с длиной маски  | IPv6-адрес с длиной маски 1-128 |
| X:X::X:X MASK      | IPv6-адрес управления и маска  | IPv6-адрес и маска |
| gateway Y.Y.Y.Y    | Адрес шлюза по умолчанию IPv4                       | IPv4-адрес шлюза                |
| gateway Y:Y::Y:Y   | Адрес шлюза по умолчанию IPv6                       | IPv6-адрес шлюза                |

### Командный режим
global config

### По умолчанию
Не назначен. На интерфейсе управления включен клиент DHCP (для IPv4) и автоматическое получение адреса для IPv6.

### Употребление

### Примеры
```console
Switch# configure terminal
Switch(config)# management ip address 192.168.100.100/24
Switch(config)# no management ip address
Switch(config)# управление ipv6 адресом 2001:1000::1000/96
Switch(config)# no management ipv6 address
```
## {index}`management route`

### Назначение команды
Используйте эту команду для задания шлюза на коммутаторе для управления IP-адресом.

### Синтаксис команды
```
management route (add|del) gateway X.X.X.X
management route ipv6 (add|del) gateway X:X::X:X
```

| Параметр  | Описание параметра | Значение параметра |
|-----------|--------------------|---------------------|
| add       | Добавление маршрута | -                   |
| del       | Удаление маршрута   | -                   |
| ipv6      | Настройка шлюза IPv6 | -                   |
| gateway      | Добавить шлюз       | X.X.X.X (IPv4) или X:X::X:X (IPv6) |
| X.X.X.X | Адрес шлюза по умолчанию IPv4 | |
| X:X::X:X | Адрес шлюза по умолчанию IPv6 | |

### Командный режим
global config

### По умолчанию
Не указан

### Употребление
Никакой

### Примеры
```console
Switch# configure terminal
Switch(config)# management route add gateway 192.168.100.254
Switch(config)# management route ipv6 add gateway 2001:1000::1
```
## {index}`show management arp`

### Назначение команды
Команда выводит {term}`ARP` таблицу для интерфейса управления.

### Синтаксис команды
```
show management arp
```

### Командный режим
privileged exec

### Примеры
```console
Switch# show management arp
Address Hardware Addr Interface
----------------+--------------------+---------- 
10.10.39.241 00:11:12:13:14:c4 mgmt-if
10.10.39.254 00:11:12:13:14:6d mgmt-if
```
## {index}`show management ip address`

### Назначение команды
Команда текущий IP-адрес, который назначен на интерфейс управления.

### Синтаксис команды
```
show management ip address
show management ipv6 address
```

### Командный режим
privileged exec 

### Примеры
```console
Switch# show management ip address
Management IP address is: 192.168.100.100/24
Gateway: 192.168.100.254
Switch# show management ipv6 address
Management IPv6 address is: 2001:1000::1000/96
Gateway: 2001:1000::1
```
## {index}`show management interface`

### Назначение команды
Команда отображает конфигурацию, текущее состояние и статистику интерфейса управления.

### Синтаксис команды
```
show management interface
```

### Командный режим
privileged exec

### Примеры
```console
Switch# show management interface
Management Interface current state: DOWN
Description:
Link encap: Ethernet    HWaddr: 94:EB:AB:88:2A:B4
Inet addr: 192.168.100.102 Mask: 255.255.255.0
Bcast: 192.168.100.255 MTU: 1500
Speed: 10 Duplex: Half
Auto-negotiation: Enable
Received: 2 Packets, 128 Bytes (128.0 b)
Transmitted: 1 Packets, 78 Bytes (78.0 b
```

### Связанные команды
{ref}`clear counters mgmt-if`

## {index}`clear counters mgmt-if`

### Назначение команды
Команда сбрасывает накопленную статистику на интерфейсе управления.

### Синтаксис команды
```
clear counters mgmt-if
```

### Командный режим
privileged exec

### Примеры
```console
Switch# clear counters mgmt-if
```

## {index}`enable password`

### Назначение команды
Данная команда используется для установки пароля, который требуется при входе пользователя в привилегированный режим EXEC.

### Синтаксис команды
```
enable password ( privielege LEVEL | ) ( 8 | ) LINE
no enable password
```

| Параметр          | Описание параметра      | Значение параметра        |
|-------------------|-------------------------|---------------------------|
| privielege LEVEL | Уровень привилегий пользователя | Значение уровня <1-4>    |
| 8                 | Указывает, что следует скрытый пароль | -                       |
| LINE            | Строка пароля           | -                       |

### Командный режим
Global Configuration

### По умолчанию
Отсутствует

### Использование
Если установлена данная команда, пользователь должен предоставить пароль при входе в привилегированный режим EXEC.

### Примеры
```console
Switch# configure terminal
Switch(config)# enable password 123
Switch(config)# exit
Switch# disable 
Switch> enable 

Password: 
Switch#
```

### Связанные команды
Отсутствуют


## {index}`terminal length`

### Назначение команды
Используйте команду terminal length в режиме EXEC для установки количества строк на текущем терминальном экране для текущей сессии. Для восстановления конфигурации по умолчанию используйте форму команды no terminal length.

### Синтаксис команды
```
terminal length LENGTH
terminal no length
```

| Параметр | Описание параметра      | Значение параметра        |
|----------|-------------------------|---------------------------|
| LENGTH    | Количество строк на экране | Числовое значение от 0 до 512. Значение нуль отключает паузу между экранами вывода. |

### Режим команды
Privileged EXEC

### По умолчанию
Длина терминального экрана автоматически определяется по умолчанию.

### Использование
Система использует значение 'LENGTH' для определения момента паузы при выводе на нескольких экранах. Значение нуля предотвращает переход на новый экран вывода.

Некоторые типы терминальных сессий не требуют указания длины экрана, так как длина экрана может быть извлечена некоторыми удаленными хостами. Например, протокол rlogin использует длину экрана для настройки параметров терминала на удаленном хосте UNIX.

### Примеры
```console
Switch# terminal length 0
```

### Связанные команды
service terminal-length

## {index}`service terminal-length`

### Назначение команды
Для установки количества строк на текущем терминальном экране для всех сессий используйте команду service terminal-length в Глобальной Конфигурации. Для восстановления конфигурации по умолчанию используйте форму команды no service terminal-length.

### Синтаксис команды
```
service terminal-length LENGTH
no service terminal-length
```

| Параметр | Описание параметра      | Значение параметра        |
|----------|-------------------------|---------------------------|
| LETNGTH    | Количество строк на экране | Числовое значение от 0 до 512. Значение нуль отключает паузу между экранами вывода. |

### Режим команды
Глобальная Конфигурация

### По умолчанию
Отсутствует

### Использование
Система использует значение длины для определения момента паузы при выводе на нескольких экранах. Значение нуля предотвращает переход на новый экран вывода.

Некоторые типы терминальных сессий не требуют указания длины экрана, так как длина экрана может быть извлечена некоторыми удаленными хостами. Например, протокол rlogin использует длину экрана для настройки параметров терминала на удаленном хосте UNIX.

### Примеры
```console
Switch# configure terminal
Switch(config)# service terminal-length 0
```

### Связанные команды
terminal length

## {index}`banner motd`

### Назначение команды
Для установки однострочного или многострочного сообщения-баннера, отображающегося на экране при входе кого-либо в коммутатор, используйте команду banner motd в Глобальной Конфигурации. Для восстановления конфигурации по умолчанию используйте форму команды no banner motd.

### Синтаксис команды
```
banner motd LINE
no banner motd
```

| Параметр | Описание параметра      | Значение параметра        |
|----------|-------------------------|---------------------------|
| LINE     | Строка сообщения         | Укажите видимый символ в качестве разделителя, введите сообщение между двумя разделителями. Поддерживается до 99 строк с 1023 символами в каждой строке. |

### Режим команды
Глобальная Конфигурация

### По умолчанию
Отсутствует

### Использование
Отсутствует

### Примеры
```console
Switch# configure terminal
Switch(config)# banner motd #

Введите текстовое сообщение.  Завершите символом '#'.
Это пример сообщения#
```

### Связанные команды
banner exec, banner login

## {index}`banner exec`

### Назначение команды
Для установки баннера exec, который отображается на всех подключенных терминалах и появляется, когда терминал находится в привилегированном режиме EXEC, используйте команду banner exec в Глобальной Конфигурации. Для восстановления конфигурации по умолчанию используйте форму команды 'no banner exec'.

### Синтаксис команды
```
banner exec LINE
no banner exec
```

| Параметр | Описание параметра      | Значение параметра        |
|----------|-------------------------|---------------------------|
| LINE     | Строка сообщения         | Укажите видимый символ в качестве разделителя, введите сообщение между двумя разделителями. Поддерживается до 99 строк с 1023 символами в каждой строке. |

### Режим команды
Глобальная Конфигурация

### По умолчанию
Отсутствует

### Использование
Отсутствует

### Примеры
```console
Switch# configure terminal
Switch(config)# banner exec #

Введите текствовое сообщение.  Завершите символом '#'.
Это пример сообщения#
```

### Связанные команды
banner motd, banner login

## {index}`banner login`

### Назначение команды
Для установки баннера при входе (login banner), который отображается на всех подключенных терминалах, и этот баннер появляется после баннера MOTD и перед приглашением к входу, используйте команду banner login в Глобальной Конфигурации. Для восстановления конфигурации по умолчанию используйте форму команды no banner login.

### Синтаксис команды
```
banner login LINE
no banner login
```

| Параметр | Описание параметра      | Значение параметра        |
|----------|-------------------------|---------------------------|
| LINE     | Строка сообщения         | Укажите видимый символ в качестве разделителя, введите сообщение между двумя разделителями. Поддерживается до 99 строк с 1023 символами в каждой строке. |

### Режим команды
Глобальная Конфигурация

### По умолчанию
Отсутствует

### Использование
Отсутствует

### Примеры
```console
Switch# configure terminal
Switch(config)# banner login #

Введите текстовое сообщение.  Завершите символом '#'.
Это пример сообщения#
```

### Связанные команды
banner exec, banner motd

## {index}`show version`

### Назначение команды
Для отображения информации о версии аппаратного обеспечения и прошивки используйте команду show version в режиме EXEC.

### Синтаксис команды
```
show version ( slot ID | )
```

| Параметр | Описание параметра      | Значение параметра        |
|----------|-------------------------|---------------------------|
| ID       | идентификатор слота     | 1-29                      |

### Режим команды
Privileged EXEC

### По умолчанию
Отсутствует

### Использование
Отсутствует

### Примеры
В следующем примере показано, как отобразить информацию о версии оборудования и прошивки:
```console
Switch# show version

NetworkOS Software, Switch, Version 5.3.8.5
Copyright (C) 2018 Switch Vendor Inc.  All rights reserved.
Текущая версия в работе: flash:/boot/uImage.p1010.48t4x.r_20181115

Время работы коммутатора: 0 дней, 19 часов, 8 минут
Тип оборудования: 52TX
Версия оборудования: 1.1
Размер SDRAM: 2048МБ
Размер Flash: 2048МБ
Версия EPLD: 2.1
Версия BootRom: 6.1.2
Серийный номер системы: E101ZB14202C
Текущая версия Web: 5.3.8.3
```

### Связанные команды
Отсутствуют

## {index}`line vty`

### Назначение команды
Для установки максимального количества входов VTY используйте эту команду в Глобальной Конфигурации. Для восстановления конфигурации по умолчанию используйте форму команды no line vty maximum.

### Синтаксис команды
```
line vty maximum MAX_VTY
no line vty maximum
line vty VTY
```

| Параметр | Описание параметра      | Значение параметра        |
|----------|-------------------------|---------------------------|
| MAX_VTY  | Максимальное количество входов VTY | Значение по умолчанию - 8. Диапазон <0-8> |
| VTY      | Номер VTY               | Диапазон <0-7>            |

### Режим команды
Глобальная Конфигурация

### По умолчанию
8

### Использование
Отсутствует

### Примеры
В следующем примере показано, как установить Max VTY на 5:
```console
Switch# configure terminal
Switch(config)# line vty maximum 5
```
Следующий пример показывает, как войти в режим конфигурации линии:
```console
Switch# configure terminal
Switch(config)# line vty 2
```

### Связанные команды
Отсутствуют

## {index}`line-password`

### Назначение команды
Эта команда устанавливает пароль для пользовательского интерфейса vty.

### Синтаксис команды
```
line-password LINE
no line-password
```

| Параметр | Описание параметра      | Значение параметра        |
|----------|-------------------------|---------------------------|
| LINE     | Строка пароля           | Длина строки [1,64], поддерживаются специальные символы |

### Режим команды
Конфигурация линии

### По умолчанию
Отсутствует

### Использование
Если установлена эта команда, пользователю необходимо ввести пароль при входе в интерфейс vty.

### Примеры
В следующем примере показано, как установить пароль:
```console
Switch# configure terminal
Switch(config)# line vty 0 7
Switch(config-line)# line-password abc
Switch(config-line)# exit
```

### Связанные команды
Отсутствуют

## {index}`exec-timeout`

### Назначение команды
Эта команда устанавливает время, после которого пользователь должен будет завершить сеанс, если не производится никаких операций.

### Синтаксис команды
```
exec-timeout MINUTES SECONDS
no exec-timeout
```

| Параметр | Описание параметра      | Значение параметра        |
|----------|-------------------------|---------------------------|
| MINUTES  | Время в минутах         | Диапазон <0-35791>        |
| SECONDS  | Время в секундах        | Диапазон <0-2147483>      |

### Режим команды
Конфигурация линии

### По умолчанию
600 секунд

### Использование
Когда пользователь заходит снова, настройки вступают в силу.

### Примеры
В следующем примере показано, как установить максимальное время входа в систему для пользователя, который не выполняет никаких операций, тогда у пользователя будет ограничен доступ в систему:
```console
Switch# configure terminal
Switch(config)# line vty 0
Switch(config-line)# exec-timeout 3 200
```

### Связанные команды
Отсутствуют

## {index}`access-class`

### Назначение команды
Эта команда применяет IPv4 ACL к линии VTY. Для восстановления настроек по умолчанию используйте форму команды no access-class.

### Синтаксис команды
```
access-class ACL-NAME in
no access-class in
```

| Параметр  | Описание параметра      | Значение параметра        |
|-----------|-------------------------|---------------------------|
| ACL-NAME  | Имя IPv4 ACL            | Строка до 40 символов     |

### Режим команды
Конфигурация линии

### По умолчанию
Отсутствует ACL

### Использование
Если ACL применен к линии VTY, ни одна из записей в ACL не будет соответствовать, за исключением IP-адреса и номера порта.

### Примеры
В следующем примере показано, как применять IPv4 ACL на VTY:
```console
Switch(config-line)# access-class acl4 in
```

### Связанные команды
ip access-list

## {index}`ipv6 access-class`

### Назначение команды
Эта команда применяет IPv6 ACL к линии VTY. Для восстановления настроек по умолчанию используйте форму команды no ipv6 access-class.

### Синтаксис команды
```
ipv6 access-class ACL-NAME in
no ipv6 access-class in
```

| Параметр  | Описание параметра      | Значение параметра        |
|-----------|-------------------------|---------------------------|
| ACL-NAME  | Имя IPv6 ACL            | Строка до 40 символов     |

### Режим команды
Конфигурация линии

### По умолчанию
Отсутствует ACL

### Использование
Если ACL применен к линии VTY, ни одна из записей в ACL не будет соответствовать, за исключением IP-адреса и номера порта.

### Примеры
```console
Switch(config-line)# ipv6 access-class aclv6 in
```

### Связанные команды
ipv6 access-list

## {index}`reboot`

### Назначение команды
Для перезагрузки операционной системы используйте команду reload в режиме Privileged EXEC.

### Синтаксис команды
```
reboot
```

### Режим команды
Privileged EXEC

### По умолчанию
Отсутствует

### Использование
Команда reboot останавливает систему. Используйте команду reboot после ввода конфигурационной информации в файл и сохранения в файл конфигурации запуска.

### Примеры
Вот пример диалога с командой reboot:
```console
Switch# reboot
```

### Связанные команды
reload

## {index}`schedule reboot at`

### Назначение команды
Для запланированной перезагрузки программного обеспечения в указанное время используйте команду schedule reboot at в режиме глобальной конфигурации. Для отмены запланированной задачи перезагрузки используйте форму команды no schedule reboot.

### Синтаксис команды
```
schedule reboot at HH:MM ( MM/DD | MM/DD/YYYY | YYYY/MM/DD )
no schedule reboot
```

| Параметр       | Описание параметра                | Значение параметра                      |
|----------------|-----------------------------------|-----------------------------------------|
| HH:MM          | Часы и минуты                     | Диапазон времени: 00:00 – 23:59         |
| MM/DD          | Указать дату для текущего года    | Диапазон дат: [1/1, 12/31]              |
| MM/DD/YYYY     | Указать дату (формат MM/DD/YYYY)  | Диапазон года: [2000, 2037]            |
| YYYY/MM/DD     | Указать дату (формат YYYY/MM/DD)  | Диапазон года: [2000, 2037]            |

### Режим команды
Глобальная конфигурация

### По умолчанию
Задача запланированной перезагрузки не определена.

### Использование
Если вы указываете месяц и день, перезагрузка запланируется на указанное время и дату. Если не указываете месяц и день, перезагрузка произойдет в указанное время текущего дня.

### Примеры
Приведенный ниже пример диалога с командой schedule reboot at:
```console
Switch# configure terminal
Switch(config)# schedule reboot at 12:12 2008/12/25
```

### Связанные команды
schedule reboot delay

## {index}`schedule reboot delay`

### Назначение команды
Для запланированной перезагрузки программного обеспечения через определенное время используйте команду 'schedule reboot delay' в режиме глобальной конфигурации. Для отмены запланированной задачи перезагрузки используйте форму команды no schedule reboot.

### Синтаксис команды
```
schedule reboot delay { HH:MM | MINUTES }
no schedule reboot
```

| Параметр  | Описание параметра  | Значение параметра      |
|-----------|---------------------|-------------------------|
| HH:MM     | Часы и минуты       | Диапазон времени: 00:00 – 23:59 |
| MINUTES   | Минуты              | Диапазон: 1-720         |

### Режим команды
Глобальная конфигурация

### По умолчанию
Задача запланированной перезагрузки не определена.

### Использование
Нет

### Примеры
Приведенный ниже пример работы с командой schedule reboot delay:
```console
Switch# configure terminal
Switch(config)# schedule reboot delay 300
```

### Связанные команды
schedule reboot at

## {index}`boot system`

### Назначение команды
Для указания системного образа, который коммутатор загружает при запуске, используйте следующие команды boot system в режиме Privileged EXEC.

### Синтаксис команды
```
boot system ( tftp: mgmt-if SERVERIP | flash:/ ) FILE_NAME
```

| Параметр     | Описание параметра            | Значение параметра                                |
|--------------|-------------------------------|---------------------------------------------------|
| flash:/      | Файл системного образа для следующей загрузки | -                                                 |
| tftp         | Файл системного образа для следующей загрузки | -                                                 |
| mgmt-if      | Порт управления               | -                                                 |
| SERVERIP     | IP-адрес сервера TFTP         | -                                                 |
| FILE_NAME    | Имя файла, который будет загружен при запуске | Полный путь и имя файла, до 255 символов          |

### Режим команды
Privileged EXEC

### По умолчанию
Отсутствует

### Использование
IP-адрес управления из файла startup-config будет использоваться в качестве адреса источника при загрузке системы через TFTP.

### Примеры
Приведенный ниже пример работы с командой boot system:
```console
Switch# boot system flash:/boot/Internal-1.0.0.25.bin
```

### Связанные команды
show boot
